Revit 2021.1 API
BarTypeDiameterOptions Properties
The BarTypeDiameterOptions type exposes the following members.
Properties
Name | Description
BarDiameter
 Represents the bar diameter of the RebarBarType.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StandardBendDiameter
 Represents the standard bar bend diameter of the RebarBarType.
StandardHookBendDiameter
 Represents the standard hook bend diameter of the RebarBarType.
StirrupTieBendDiameter
 Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace